In [1]:
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

In [31]:
df = pd.read_csv('No2 dataset.csv')
df.head()

             Date_Time  NO2(GT)
0  10/03/2004 18.00.00      166
1  10/03/2004 19.00.00     1174
2  10/03/2004 20.00.00      131
3  10/03/2004 21.00.00      172
4  10/03/2004 22.00.00      131

In [3]:
df.dtypes

Date_Time    object
NO2(GT)       int64
dtype: object

## Convert to datetime

In [4]:
# By default datatime is taken as object but we should change it
df['Date_Time'] = pd.to_datetime(df['Date_Time'], format='%d/%m/%Y %H.%M.%S')
df.dtypes

Date_Time    datetime64[ns]
NO2(GT)               int64
dtype: object

#### Format depend on your data. Here are a few examples

1. **1/12/2001**: %d/%m/%Y
2. **2001/12/1**: %Y/%m/%d
3. **2001-12-01**: %Y-%m-%d
4. **2001-12-01 09:00**: %Y-%m-%d %H:%M

In [5]:
df['Date_Time'].max(), df['Date_Time'].min()

(Timestamp('2004-09-24 02:00:00'), Timestamp('2004-03-10 18:00:00'))

### Extract hour and minute

In [6]:
df['Date_Time'].dt.hour.head()

0    18
1    19
2    20
3    21
4    22
Name: Date_Time, dtype: int64

In [8]:
df['Date_Time'].dt.minute.head()

0    0
1    0
2    0
3    0
4    0
Name: Date_Time, dtype: int64

## The day of week - Monday(0) to Sunday(6)

In [12]:
df['Date_Time'].dt.dayofweek.head(7)

0    2
1    2
2    2
3    2
4    2
5    2
6    3
Name: Date_Time, dtype: int64

In [14]:
 df['Date_Time'].dt.weekday_name.head(7)

AttributeError: 'DatetimeProperties' object has no attribute 'weekday_name'

## Extracting the month from date

In [15]:
df['Date_Time'].dt.month.head(7)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
Name: Date_Time, dtype: int64

In [16]:
# is the date end of the month
df['Date_Time'].dt.is_month_end.head(7)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: Date_Time, dtype: bool

## Put it all together

In [18]:
new_df = pd.DataFrame({"year": df['Date_Time'].dt.year,
              "month": df['Date_Time'].dt.month,
              "day": df['Date_Time'].dt.day,
              "hour": df['Date_Time'].dt.hour,
              "dayofyear": df['Date_Time'].dt.dayofyear,
              "week": df['Date_Time'].dt.week,
              "dayofweek": df['Date_Time'].dt.dayofweek,
              #"dayofweekname": df['Date_Time'].dt.weekday,
              "quarter": df['Date_Time'].dt.quarter,
             })
new_df.head()

   year  month  day  hour  dayofyear  week  dayofweek  quarter
0  2004      3   10    18         70    11          2        1
1  2004      3   10    19         70    11          2        1
2  2004      3   10    20         70    11          2        1
3  2004      3   10    21         70    11          2        1
4  2004      3   10    22         70    11          2        1

In [19]:
complete_data = pd.concat([df, new_df], axis=1)
complete_data.head()

,Date_Time,NO2(GT),year,month,day,hour,dayofyear,week,dayofweek,quarter
0,2004-03-10 18:00:00,166,2004,3,10,18,70,11,2,1
1,2004-03-10 19:00:00,1174,2004,3,10,19,70,11,2,1
2,2004-03-10 20:00:00,131,2004,3,10,20,70,11,2,1
3,2004-03-10 21:00:00,172,2004,3,10,21,70,11,2,1
4,2004-03-10 22:00:00,131,2004,3,10,22,70,11,2,1

## is_weekday? (Create using the dayofweek number)

In [21]:
complete_data['is_weekday']=0
for i in range(0, len(complete_data)):
    if((complete_data['dayofweek'][i] == 5) | (complete_data['dayofweek'][i] == 6)):
        complete_data['is_weekday'][i] = 0
    else:
        complete_data['is_weekday'][i] = 1

In [23]:
complete_data[['dayofweek','is_weekday']].head()

   dayofweek  is_weekday
0          2           1
1          2           1
2          2           1
3          2           1
4          2           1

## Difference Between Dates

In [34]:
import pandas as pd
agent = pd.read_csv('train_loan.csv')
agent.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y